[
  {
    "question": "During online classes, I understood something better after I",
    "optionA": "tried it out.",
    "optionB": "thought it through"
  },
  {
    "question": "While learning through online mode, I would rather be considered",
    "optionA": "realistic.",
    "optionB": "innovative."
  },
  {
    "question": "When I used to think about what I had done a day before, I was most likely to get",
    "optionA": "a picture.",
    "optionB": "words."
  },
  {
    "question": "During online learning, I would tend to",
    "optionA": "understand details of a subject but may be fuzzy about its overall structure.",
    "optionB": "understand the overall structure but may be fuzzy about details."
  },
  {
    "question": "During online classes when I was learning something new, it would help me to",
    "optionA": "talk about it.",
    "optionB": "think about it."
  },
  {
    "question": "If I were a teacher teaching in online mode, I would rather teach a course",
    "optionA": "that deals with facts and real life situations.",
    "optionB": "that deals with ideas and theories."
  },
  {
    "question": "While learning online, I preferred to get new information in",
    "optionA": "pictures, diagrams, graphs, or maps.",
    "optionB": "written directions or verbal information."
  },
  {
    "question": "During online learning, once I understood",
    "optionA": "all the parts, I understand the whole thing.",
    "optionB": "the whole thing, I see how the parts fit."
  },
  {
    "question": "In a breakout room while working on difficult material, I was more likely to",
    "optionA": "jump in and contribute ideas.",
    "optionB": "sit back and listen."
  },
  {
    "question": "During online classes, I found it easier",
    "optionA": "to learn facts.",
    "optionB": "to learn concepts."
  },
  {
    "question": "While studying a book with lots of pictures and charts by myself during COVID, I was likely to",
    "optionA": "look over the pictures and charts carefully.",
    "optionB": "focus on the written text."
  },
  {
    "question": "During online classes, when I solved maths problems",
    "optionA": "I usually worked my way to the solutions one step at a time.",
    "optionB": "I often just saw the solutions but then had to struggle to figure out the steps to get to them."
  },
  {
    "question": "In online classes I have taken,",
    "optionA": "I have usually got to know many of the students.",
    "optionB": "I have rarely got to know many of the students."
  },
  {
    "question": "During online mode, while reading non-fiction, I preferred",
    "optionA": "something that teaches me new facts or tells me how to do something.",
    "optionB": "something that gives me new ideas to think about."
  },
  {
    "question": "During online classes, I liked teachers",
    "optionA": "who put a lot of diagrams on the whiteboard.",
    "optionB": "who spent a lot of time explaining."
  },
  {
    "question": "While learning in online mode, when I'm analysing a story or a novel",
    "optionA": "I thought of the incidents and tried to put them together to figure out the themes.",
    "optionB": "I just knew what the themes were when I finished reading and then I had to go back and find the incidents that demonstrated them."
  },
  {
    "question": "During online mode, when I started a homework problem, I was more likely to",
    "optionA": "start working on the solution immediately.",
    "optionB": "try to fully understand the problem first."
  },
  {
    "question": "During online classes, I preferred the idea of",
    "optionA": "certainty.",
    "optionB": "theory."
  },
  {
    "question": "While learning in online mode, I remembered best",
    "optionA": "what I saw.",
    "optionB": "what I heard."
  },
  {
    "question": "In online classes, it was more important to me that an instructor",
    "optionA": "laid out the material in clear sequential steps.",
    "optionB": "gave me an overall picture and relate the material to other subjects."
  },
  {
    "question": "During online classes, I preferred to study",
    "optionA": "in a group.",
    "optionB": "alone."
  },
  {
    "question": "While learning in online mode, I was more likely to be considered",
    "optionA": "careful about the details of my work.",
    "optionB": "creative about how to do my work."
  },
  {
    "question": "When I get directions to a new place, I prefer",
    "optionA": "a map.",
    "optionB": "written instructions."
  },
  {
    "question": "In online learning mode, I learnt",
    "optionA": "at a fairly regular pace. If I studied hard, I would \"get it.\"",
    "optionB": "in fits and starts. I would be totally confused and then suddenly it all \"clicks.\""
  },
  {
    "question": "During online classes, I would rather first",
    "optionA": "try things out.",
    "optionB": "think about how I was going to do it."
  },
  {
    "question": "During online learning, when I would read for enjoyment, I would like writers to",
    "optionA": "clearly say what they mean.",
    "optionB": "say things in creative, interesting ways."
  },
  {
    "question": "When I saw a diagram or sketch in an online class, I was most likely to remember",
    "optionA": "the picture.",
    "optionB": "what the instructor had said about it."
  },
  {
    "question": "When considering a body of information in online learning mode, I was more likely to",
    "optionA": "focus on details and miss the big picture.",
    "optionB": "try to understand the big picture before getting into the details."
  },
  {
    "question": "During online mode, I would more easily remember",
    "optionA": "something I had done.",
    "optionB": "something I had thought a lot about."
  },
  {
    "question": "When I had to perform a task during an online class, I preferred to",
    "optionA": "master one way of doing it.",
    "optionB": "come up with new ways of doing it."
  },
  {
    "question": "During online mode, when someone showed me data, I preferred",
    "optionA": "charts or graphs.",
    "optionB": "text summarizing the results."
  },
  {
    "question": "When writing a paper during online classes, I was more likely to",
    "optionA": "work on (think about or write) the beginning of the paper and progress forward.",
    "optionB": "work on (think about or write) different parts of the paper and then order them."
  },
  {
    "question": "During online mode, when I had to work on a group project, I would first want to",
    "optionA": "have a \"group brainstorming\" where everyone contributes ideas.",
    "optionB": "brainstorm individually and then come together as a group to compare ideas."
  },
  {
    "question": "While learning in online mode, I would consider it higher praise to call someone",
    "optionA": "sensible.",
    "optionB": "imaginative."
  },
  {
    "question": "When I met people on Zoom during online classes, I was more likely to remember",
    "optionA": "what they looked like.",
    "optionB": "what they said about themselves."
  },
  {
    "question": "When I was learning a new subject online, I preferred to",
    "optionA": "stay focused on that subject, learning as much about it as I can.",
    "optionB": "try to make connections between that subject and related subjects."
  },
  {
    "question": "During online learning mode, I was more likely to be considered",
    "optionA": "outgoing.",
    "optionB": "reserved."
  },
  {
    "question": "In online mode, I preferred courses that emphasise",
    "optionA": "concrete material (facts, data).",
    "optionB": "abstract material (concepts, theories)."
  },
  {
    "question": "During COVID lockdown, for entertainment, I would rather",
    "optionA": "watch television.",
    "optionB": "read a book."
  },
  {
    "question": "During online classes, some teachers would start their lessons with an outline of what they will cover. Such outlines were",
    "optionA": "somewhat helpful to me.",
    "optionB": "very helpful to me."
  },
  {
    "question": "During online learning, the idea of doing homework in groups, with one grade for the entire group,",
    "optionA": "appeals to me.",
    "optionB": "does not appeal to me."
  },
  {
    "question": "While studying via online mode, when I did long calculations,",
    "optionA": "I tended to repeat all my steps and check my work carefully.",
    "optionB": "I found checking my work tiresome and have to force myself to do it."
  },
  {
    "question": "During lockdown, I tended to picture places I have been to",
    "optionA": "easily and fairly accurately.",
    "optionB": "with dificulty and without much detail."
  },
  {
    "question": "In online mode, when solving problems in a group, I would be more likely to",
    "optionA": "think of the steps in the solution process.",
    "optionB": "think of possible consequences or applications of the solution in a wide range of areas."
  }
]
